# Author: Claudio <3261958605@qq.com>
# Created: 2017-04-20 17:08:42
# Commentary:
#+TITLE: 文本处理

** 字符串格式语法
   格式化字符串时，str.format()方法和Formatter类使用相同的语法。使用后
   者时，可定制格式语法。
   
   格式字符串中需被替换的地方使用{}，其余文本保持原样。如需表示{}本身，
   需使用{{}}。
   
   一些简单的例子：
   
   #+BEGIN_SRC python :session
     import string

     'First, thou shalt count to {0}'.format(1000)
     'Bring me a {}'.format('book')
     'From {} to {}'.format('New York', 'China')
     'My quest is {name}'.format(name='Claudio')
     'Units destroyed: {player[0]}'.format(player=[1, 2, 3])
     'Weight in tons {0.digits}'.format(string)
   #+END_SRC
   
   #+RESULTS[ad8196a5794c94864c2ca2f0013241ca39d784a2]:
   :
   : >>> 'First, thou shalt count to 1000'
   : 'Bring me a book'
   : 'From New York to China'
   : 'My quest is Claudio'
   : 'Units destroyed: 1'
   : 'Weight in tons 0123456789'
   
   一般情况下，使用format函数时调用的是对象上的__format__()方法。不过，
   可使用下面三个标记转换：
   
   | 标记 | 调用函数 |
   |------+----------|
   | !s   | str()    |
   | !r   | repr()   |
   | !a   | ascii()  |
   
   #+BEGIN_SRC python :session
     '我是一个聪明的 {!s}'.format('男孩')
     '我是一个聪明的 {!r}'.format('男孩')
     '我是一个聪明的 {!a}'.format('男孩')
   #+END_SRC
   
   #+RESULTS[17870e409219a15570f5dad1340074afa9113f69]:
   : '我是一个聪明的 男孩'
   : "我是一个聪明的 '男孩'"
   : "我是一个聪明的 '\\u7537\\u5b69'"
   
**** 对数字正负号的标记

     | 标记  | 含义                         |
     |-------+------------------------------|
     | +     | 不管正负数，都在前面添加符号 |
     | -     | 仅在负数前添加符号           |
     | space | 整数前用空格，负数前用负号   |

     #+BEGIN_SRC python :session
       '{:+}'.format(100)
       '{:+}'.format(-100)

       '{:-}'.format(100)
       '{:-}'.format(-100)

       '{: }'.format(100)
       '{: }'.format(-100)
     #+END_SRC

     #+RESULTS[45bf5deb6bd6ff4171aad64fd3efccb562f068fe]:
     : '+100'
     : '-100'
     : >>> '100'
     : '-100'
     : >>> ' 100'
     : '-100'

**** 整数进制转换

     | 标记 | 含义                                |
     |------+-------------------------------------|
     | b    | 二进制                              |
     | c    | 转换为Unicode字符                   |
     | d    | 10进制                              |
     | o    | 8进制                               |
     | x    | 16进制，小写                        |
     | X    | 16进制，大写                        |
     | n    | 同'd'，不过会使用本地环境的间隔字符 |
     | None | 同'd'                               |

     此外，还可使用下面表示浮点数的标记。

     #+BEGIN_SRC python :session
       n = 10
       '{:b}'.format(n)
       '{:c}'.format(n)
       '{:d}'.format(n)
       '{:o}'.format(n)
       '{:x}'.format(n)
       '{:X}'.format(n)
       '{:n}'.format(n)
       '{:}'.format(n)
     #+END_SRC
     
     #+RESULTS[29af31cdf7cc6c6480470e2f38ab32044cea119d]:
     :
     : '1010'
     : '\n'
     : '10'
     : '12'
     : 'a'
     : 'A'
     : '10'
     : '10'

     可使用“#”显示进制：

     #+BEGIN_SRC python :session
       n = 10
       '{:#b}'.format(n)
       '{:c}'.format(n)
       '{:#d}'.format(n)
       '{:#o}'.format(n)
       '{:#x}'.format(n)
       '{:#X}'.format(n)
       '{:#n}'.format(n)
       '{:#}'.format(n)
     #+END_SRC

     #+RESULTS[50be5b3b00ec1a3e12e2421107e20074e88ce3f9]:
     :
     : '0b1010'
     : '\n'
     : '10'
     : '0o12'
     : '0xa'
     : '0XA'
     : '10'
     : '10'

     还可使用“,”在数字中插入逗号：

     #+BEGIN_SRC python :session
       '{:,}'.format(1233456)
       '{:,}'.format(12334.56)
     #+END_SRC

     #+RESULTS[c285eba7a28d863f64d13e88be34504cd77975af]:
     : '1,233,456'
     : '12,334.56'

**** 浮点数和整数都可用的标记
     
     | 标记 | 含义                               |
     |------+------------------------------------|
     | e    | 科学计数法，小写e，默认精度6       |
     | E    | 同上，大写E                        |
     | f    | 固定小数点后位数为6位              |
     | F    | 同上，不过将nan变为NAN，inf变为INF |
     | g    |                                    |
     | G    | 智能使用科学计数法                 |
     | n    | 同g，不过根据本地环境插入分割字符  |
     | %    | 百分数表示                         |
     | None | 同g，。。。                        |

     #+BEGIN_SRC python :session
       n = 123456789.123456789
       # import math
       # n = math.pi
       '{:e}'.format(n)
       '{:E}'.format(n)
       '{:f}'.format(n)
       '{:F}'.format(n)
       '{:g}'.format(n)
       '{:G}'.format(n)
       '{:n}'.format(n)
       '{:%}'.format(n)
       '{:}'.format(n)
     #+END_SRC

     #+RESULTS[3049f910b6f0410f5423f380d04d5552d37570ad]:
     #+begin_example

     ... ... '1.234568e+08'
     '1.234568E+08'
     '123456789.123457'
     '123456789.123457'
     '1.23457e+08'
     '1.23457E+08'
     '1.23457e+08'
     '12345678912.345678%'
     '123456789.12345679'
     #+end_example

**** 通过位置获取参数
     
     #+BEGIN_SRC python :session
       '{0}, {1}, {2}'.format('a', 'b', b'c')
       '{}, {}, {}'.format('a', 'b', 'c')
       '{2}, {1}, {0}'.format('a', 'b', 'c')
       '{2}, {1}, {0}'.format(*'abc')
       '{0} and {1!r} and {0}'.format('apple', 'banana')
     #+END_SRC
     
     #+RESULTS[41fdca0209912ddff3a7f23f0cf4412f661662fd]:
     : "a, b, b'c'"
     : 'a, b, c'
     : 'c, b, a'
     : 'c, b, a'
     : "apple and 'banana' and apple"
     
**** 通过名称获取参数

     #+BEGIN_SRC python :session
       '{country}的首都是{capital}'.format(country='中国', capital='北京')

       item = {'country': '中国', 'capital': '北京'}
       '{country}的首都是{capital}'.format(**item)
     #+END_SRC

     #+RESULTS[efc629a84afdde096307cff5ccf4cb4b70f4e72d]:
     : '中国的首都是北京'
     : >>> >>> '中国的首都是北京'

**** 使用%s代替%r

     #+BEGIN_SRC python :session
       'reper()函数会显示引号：{!r}；str()函数则不会：{!s}'.format('abc', 'ABC')
     #+END_SRC

     #+RESULTS[7ffd29edf6f25d4e7584bc7ea2b28592bd4228a5]:
     : "repr()函数会显示引号：'abc'；str()函数则不会：ABC"

**** 对齐和指定宽度
     中文占两个字母宽度？？？
     
     #+BEGIN_SRC python :session
       '{:<20}'.format('左对齐')
       '{:>20}'.format('右对齐')
       '{:^20}'.format('居中')
       '{:*^20}'.format('居中，用信号填补空白')
     #+END_SRC
     
     #+RESULTS[324468f0b45ad342ac39828391573e69028d3c3c]:
     : '左对齐                 '
     : '                 右对齐'
     : '         居中         '
     : '*****居中，用信号填补空白*****'
     
**** 替换%x和%o，并转换不同进制

     #+BEGIN_SRC python :session
       '10进制：{0:d}，16进制：{0:x}；8进制：{0:o}; 2进制：{0:b}'.format(42)
       '10进制：{0:d}，16进制：{0:#x}；8进制：{0:#o}; 2进制：{0:#b}'.format(42)
     #+END_SRC

     #+RESULTS[2cad6a8e795f81c756462863e55fa248aaf208e2]:
     : '10进制：42，16进制：2a；8进制：52; 2进制：101010'
     : '10进制：42，16进制：0x2a；8进制：0o52; 2进制：0b101010'

**** 使用逗号分割大数字

     #+BEGIN_SRC python :session
       '{:,}'.format(123456789)
     #+END_SRC

     #+RESULTS[5f51ce4e908837634f9c240f8eb939d04800ccce]:
     : '123,456,789'

**** 添加百分号

     #+BEGIN_SRC python :session
       '{:%}'.format(1 / 3)
       '{:.2%}'.format(1 / 3)
     #+END_SRC

     #+RESULTS[63b0909883ed719c3d68a87ee2643a99578e3b74]:
     : '33.333333%'
     : '33.33%'

**** 改造
     可以通过集成Template类，定制占位符语法，边界符（delimiter），或整
     个解析模板字符串的正则。可重置的类属性有：
     
     - delimiter：占位符字符串。默认为$。不要使用正则，因为实现会根据
       需要对齐调用re.escape()方法。
       
       #+BEGIN_SRC python :session
         from string import Template

         class MyTemp(Template):
             delimiter = '#'

         temp = MyTemp('hello #{name}')
         temp.substitute(name='world')
       #+END_SRC
       
       #+RESULTS[fc099f2bb9ab16e7c1edf89910812ebd47ec3fae]:
       :
       : >>> >>> ... ... >>> >>> >>> 'hello world'
       
     - idpattern： 在不使用大括号包裹placeholder时，会根据此正则默然添
       加大括号，默认值为[_a-z][_a-z0-9]*。
       
       #+BEGIN_SRC python :session
         from string import Template

         class MyTemp(Template):
             idpattern = '[_a-z][_a-z0-9。]*'

         temp = Template('我喜欢吃$food。')
         mytemp = MyTemp('我喜欢吃${food}。')
         mytemp1 = MyTemp('我喜欢吃$food。')
         # mytemp1 = MyTemp('我喜欢吃$food。')
         temp.substitute(food='orange')
         mytemp.substitute(food='orange')
         mytemp1.substitute(food='orange')
       #+END_SRC
       
       #+RESULTS[0374890ede19258988ff3970e5661dfbf14b2966]:
       #+begin_example
       
       >>> ... ... >>> >>> >>> >>> ... '我喜欢吃orange。'
       '我喜欢吃orange。'
       Traceback (most recent call last):
         File "<stdin>", line 1, in <module>
         File "/usr/lib/python3.5/string.py", line 129, in substitute
           return self.pattern.sub(convert, self.template)
         File "/usr/lib/python3.5/string.py", line 119, in convert
           val = mapping[named]
       KeyError: 'food。'
       #+end_example
       
     - flags：当编译用于识别替换的正则时使用的正则flags。默认值为
       re.IGNORECASE。
       
       *注意* ：re.VERBOSE总是会添加到flags中，所以定制idpatterns属性
       时，需遵从verbose正则的规则。
       
       #+BEGIN_SRC python :session
       from string import Template
       import re

       class Mytemp(Template):
           flags = re.IGNORECASE

       temp = Mytemp('我喜欢吃$food')

       temp.substitute(Food='banana')
       #+END_SRC
       
       #+RESULTS[5000775d8ec6b226692cd1ed152ee8be520d8ac7]:
       :
       : >>> >>> ... ... >>> >>> >>> Traceback (most recent call last): 
       :   File "<stdin>", line 1, in <module>
       :   File "/usr/lib/python3.5/string.py", line 129, in substitute
       :     return self.pattern.sub(convert, self.template)
       :   File "/usr/lib/python3.5/string.py", line 119, in convert
       :     val = mapping[named]
       : KeyError: 'food'
       
     另外，还可重置匹配整个placeholder的属性pattern。其值需为含4组
     “named capture group”的正则。每组与上面的3条规则对应，另外还添加
     了无效placeholder规则：
     
     - escaped：边界符本身的正则。如默认值$$。
     - named：不加大括号匹配placeholder名的正则。不要将边界付置于
       capturing group中。
     - braced：添加大括号时匹配placeholder名的正则。不要将边界符和大括
       号置于capturing group中。
     - invalid：This group matches any other delimiter pattern
       (usually a single delimiter)？？？应出现在整个正则的最后。
       
*** 配对检查
    下面的例子中将使用此帮助函数打印匹配对象：
    
    #+BEGIN_SRC python :session
      def displaymatch(match):
          if match is None:
              print(None)
          else:
              print('<Match: {}, groups={}>'.format(match.group(), match.groups()))
    #+END_SRC
    
    #+RESULTS[816acc52ed86904f3cb4c7f9122ec16bfc5dc22e]:
    
    假设编写一个扑克程序，每个玩家手中有5张牌，“a”代表Ace，“k”代表King，
    “q”代表queen，“j”代表Jack，“t”代表10，2-9分别代表其他牌。则可使用
    正则检查玩家手中牌的数量和值是否正确：
    
    #+BEGIN_SRC python :session
      import re
      valid = re.compile(r'^[a2-9tjqk]{5}$')
      displaymatch(valid.match('aktq'))
      displaymatch(valid.match('ajt5e'))
      displaymatch(valid.match('akt'))
      displaymatch(valid.match('727ak'))
    #+END_SRC

    #+RESULTS[5cc6723551093a93dbe49fe376b7448b733868c4]:
    :
    : >>> None
    : None
    : None
    : <Match:  727ak, groups=()>

    使用反向引用查看是否有“对子”：

    #+BEGIN_SRC python :session
      import re
      pair = re.compile(r'.*(.).*\1')
      displaymatch(pair.match('717ak'))
      displaymatch(pair.match('718ak'))
      displaymatch(pair.match('354aa'))
    #+END_SRC

    #+RESULTS[666c51b269209024d7a98fe9deafb5fa91c79730]:
    :
    : >>> <Match: 717, groups=('7',)>
    : None
    : <Match:  354aa, groups=('a',)>

    以及使用group方法查看“对子”时什么：

    #+BEGIN_SRC python :session
      pair.match('354aa').group(1)
    #+END_SRC

    #+RESULTS[c66a65d33f2b050da5633b9273b338949000d9de]:
    : 'a'

*** 制作分词器
    分词器是将字符串分类。编写解释器或编译器的第一步就是利用分词器分词。
    
    文本分类为单个正则，将他们所有结合在一个总正则中然后历遍匹配。
    
    #+BEGIN_SRC python :session
      import collections
      import re

      Token = collections.namedtuple('Token', ['typ', 'value', 'line', 'column'])


      def tokenize(code):
          keywords = {'IF', 'THEN', 'ENDIF', 'FOR', 'NEXT', 'GOSUB', 'RETURN'}
          token_specification = [
              ('NUMBER', r'\d+(\.\d*)?'),  # 整数或浮点数
              ('ASSIGN', r':='),        # 赋值操作符
              ('END', r';'),            # 语句结束标识
              ('ID', r'[A-Za-z]+'),     # Identifier
              ('OP', r'[-+*/]'),        # 数学运算符
              ('NEWLINE', r'\n'),       # 换行
              ('SKIP', r'[ \t]'),       # 跳过空格和tab
              ('MISMATCH', r'.')        # 其他
          ]
          tok_regex = '|'.join('(?P<{0[0]}>{0[1]})'.format(pair)
                               for pair in token_specification)
          line_num = 1
          line_start = 0
          for mo in re.finditer(tok_regex, code):
              kind = mo.lastgroup
              value = mo.group(kind)
              if kind == 'NEWLINE':
                  line_start = mo.end()
                  line_num += 1
              elif kind == 'SKIP':
                  pass
              elif kind == 'MISMATCH':
                  raise RuntimeError(
                      '{} unexpected on line {}'.format(value, line_num))
              else:
                  if kind == 'ID' and value in keywords:
                      kind = value
                  column = mo.start() - line_start
                  yield Token(kind, value, line_num, column)

      statements = ''' IF quantity THEN
              total := total + price * quantity;
              tax := price * 0.05;
      ENDIF;
      '''

      for token in tokenize(statements):
          print(token)
    #+END_SRC

    #+RESULTS[34edca470cd7177c40d3aff00d84a96d059feae1]:
    #+begin_example

    >>> >>> >>> >>> >>> ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... >>> >>> ... ... ... ... >>> >>> ... ... Token(typ='IF', value='IF', line=1, column=1)
    Token(typ='ID', value='quantity', line=1, column=4)
    Token(typ='THEN', value='THEN', line=1, column=13)
    Token(typ='ID', value='total', line=2, column=8)
    Token(typ='ASSIGN', value=':=', line=2, column=14)
    Token(typ='ID', value='total', line=2, column=17)
    Token(typ='OP', value='+', line=2, column=23)
    Token(typ='ID', value='price', line=2, column=25)
    Token(typ='OP', value='*', line=2, column=31)
    Token(typ='ID', value='quantity', line=2, column=33)
    Token(typ='END', value=';', line=2, column=41)
    Token(typ='ID', value='tax', line=3, column=8)
    Token(typ='ASSIGN', value=':=', line=3, column=12)
    Token(typ='ID', value='price', line=3, column=15)
    Token(typ='OP', value='*', line=3, column=21)
    Token(typ='NUMBER', value='0.05', line=3, column=23)
    Token(typ='END', value=';', line=3, column=27)
    Token(typ='ENDIF', value='ENDIF', line=4, column=0)
    Token(typ='END', value=';', line=4, column=5)
    #+end_example

** difflib. *context_diff* (a,b,fromfile="",tofile="",fromfiledate="",tofiledate="",n=3,lineterm="\n")
   比较A和B（字符串链表），返回上下文差异格式的字符串组成的生成器（生
   成比较结果字符串）。

   显示修改内容，以及几行上下文行。上下文行数由参数N控制，默认为3。

   默认情况下，控制行（有***和---的行），后面会自动添加换行符，可使用
   LINETERM参数修改。

   可使用FROM/TOFILE和FROM/TOFILEDATE参数指定显示时的文件名，很修改时
   间。FROM/TOFILEDATE的格式为 [[http://baike.baidu.com/item/ISO%25208601][ISO 8601]] 时间格式。

   #+BEGIN_SRC python :session
     from difflib import context_diff
     import sys
     s1 = ['bacon\n', 'eggs\n', 'ham\n', 'guido\n']
     s2 = ['python\n', 'eggy\n', 'hamster\n', 'guido\n']

     sys.stdout.writelines(context_diff(
         s1, s2, n=1, fromfile='file1', tofile='file2', fromfiledate='2007-01-02', lineterm='\n\t\t'))
   #+END_SRC

   #+RESULTS[bddce0372c7d83ed64cd0fbc8fcc56c5826fb1b7]:
   #+begin_example

   >>> >>> >>> >>> ... *** file1	2007-01-02
           --- file2
           ***************
           *** 1,4 ****
           ! bacon
   ! eggs
   ! ham
     guido
   --- 1,4 ----
           ! python
   ! eggy
   ! hamster
     guido
   #+end_example

** difflib. *ndiff* (a,b,linejunk=None,charchunk=IS_CHARACTER_JUNK)
   比较A和B（字符串链表），返回Differ风格的delta（生成delta行的生成器）。

   可选参数LINEJUNK和CHARJUNK为过滤函数（或None）。

   - LINEJUNK：接受单个字符串参数，如需指定参数为垃圾行，则返回True，
     否则返回False。默认值为None。可使用模块级别函数IS_LINE_JUNK，指定
     过滤不含可见字符的行，except for at most one pound character
     ('#')。背后的SequenceMatcher类会动态分析哪行出现频率高，并将其作
     为垃圾行，所以比此函数实用。？？？
   - CHARJUNK：接受单个字符串参数（长度为1），如需指定该字符为垃圾字符，
     则返回True，否则返回False。默认值为模块级别函数
     IS_CHARACTER_JUNK()，过滤空白字符（空格和tab）。最好不要实用此参
     数过滤换行符。

   #+BEGIN_SRC python :session
     from difflib import ndiff, IS_LINE_JUNK
     diff = ndiff('one\ntwo\nthree\n'.splitlines(keepends=True),
                  'ore\ntree\nemu\n'.splitlines(keepends=True), linejunk=IS_LINE_JUNK)
     print(diff)
     print(''.join(diff), end='')
   #+END_SRC
   
   #+RESULTS[2fa747cb46c39a13ef7aaa99a43526e3e2d7ded9]:
   #+begin_example

   ... >>> <generator object Differ.compare at 0x7ff8b7e45fc0>
   - one
   ?  ^
   + ore
   ?  ^
   - two
   - three
   ?  -
   + tree
   + emu
   #+end_example

** difflib. *unifies_diff* (a,b,fromfile="",tofile="",fromfiledate="",tofiledate="",n=3,lineterm="\n")
   与context_diff方法用法相同。只是生成unified-diff风格结果。

   #+BEGIN_SRC python :session
     from difflib import unified_diff
     import sys

     s1 = ['bacon\n', 'eggs\n', 'ham\n', 'guido\n']
     s2 = ['python\n', 'eggy\n', 'hamster\n', 'guido\n']
     sys.stdout.writelines(unified_diff(s1, s2, fromfile='a.txt', tofile='b.txt'))
   #+END_SRC

   #+RESULTS[37231eb023b1ece630447ccadd37ddda1e4a51f9]:
   #+begin_example

   >>> >>> >>> >>> --- a.txt
   +++ b.txt
   @@ -1,4 +1,4 @@
   -bacon
   -eggs
   -ham
   +python
   +eggy
   +hamster
    guido
   #+end_example

** SequenceMatcher举例
   下面将空格作为垃圾字符，进行两个字符串比较：
   
   #+BEGIN_SRC python :session
     from difflib import SequenceMatcher

     sm = SequenceMatcher(lambda x: x == ' ', 'private Thread correntThread;',
                          'private volatile Thread currentThread;')
   #+END_SRC
   
   使用ratio()方法查看相似度。一般相似度为0.6表示接近：
   
   #+BEGIN_SRC python :session
     print(round(sm.ratio(), 3))
   #+END_SRC
   
   #+RESULTS[fcb93acff806b9e3a68b9fd8772aa205ab1ca0ce]:
   : 0.836
   
   如果只关心是否有匹配，可使用get_matching_blocks()：

   #+BEGIN_SRC python :session
     for block in sm.get_matching_blocks():
         print('a[{}] and b[{}] match for {} elements'.format(
             block.a, block.b, block.size))

     SequenceMatcher(None, '', '').get_matching_blocks()
   #+END_SRC
   
   #+RESULTS[88f0739b36b32bc72aac669b80392bcfbf2aa3c9]:
   :
   : ... ... a[0] and b[0] match for 8 elements
   : a[8] and b[17] match for 8 elements
   : a[17] and b[26] match for 12 elements
   : a[29] and b[38] match for 0 elements
   : >>> [Match(a=0, b=0, size=0)]

   如果只关心如果将第一个序列改变为第二个序列，可使用get_opcodes()方法：

   #+BEGIN_SRC python :session
     for opcode in sm.get_opcodes():
         print('{:8} a[{}:{}] b[{}:{}]'.format(*opcode))
   #+END_SRC

   #+RESULTS[7a72b1be51e63927b589c4c6369449251d4fd791]:
   :
   : ... equal    a[0:8] b[0:8]
   : insert   a[8:8] b[8:17]
   : equal    a[8:16] b[17:25]
   : replace  a[16:17] b[25:26]
   : equal    a[17:29] b[26:38]

** Differ举例
   先声明两个由文本行（末尾有换行符的字符串）组成的序列：
   
   #+BEGIN_SRC python :session
     text1 = '''1. Beautiful is better than ugly.
     2. Explicit is better than implicit.
     3. Simple is better than complex.
     4. Complex is better than complicated.
     '''.splitlines(keepends=True)

     text2 = '''1. Beautiful is better than ugly.
     3. Simple is better than complex.
     4. Complicated is better than complex.
     5. Flat is better than nested.
     '''.splitlines(keepends=True)
   #+END_SRC
   
   再声明Differ对象：
   
   #+BEGIN_SRC python :session
     from difflib import Differ
     d = Differ()
   #+END_SRC
   
   使用compare比较者两个字符串，并转换为链表美化输出：
   
   #+BEGIN_SRC python :session
     from pprint import pprint

     d.compare(text1, text2)
     result = list(d.compare(text1, text2))
     pprint(result)
   #+END_SRC

   #+RESULTS[8e6e2df29dfedc1b9237435b472f5b30f89191ed]:
   #+begin_example

   >>> <generator object Differ.compare at 0x7ff8b7de8360>
   >>> ['  1. Beautiful is better than ugly.\n',
    '- 2. Explicit is better than implicit.\n',
    '  3. Simple is better than complex.\n',
    '- 4. Complex is better than complicated.\n',
    '?          ^                     ---- ^\n',
    '+ 4. Complicated is better than complex.\n',
    '?         ++++ ^                      ^\n',
    '+ 5. Flat is better than nested.\n']
   #+end_example

   或使用writelines()方法直接输出：

   #+BEGIN_SRC python :session
     import sys
     sys.stdout.writelines(result)
   #+END_SRC

   #+RESULTS[92400f416f77f13268b50845eb908bde18393cbd]:
   :
   : 1. Beautiful is better than ugly.
   : - 2. Explicit is better than implicit.
   :   3. Simple is better than complex.
   : - 4. Complex is better than complicated.
   : ?          ^                     ---- ^
   : + 4. Complicated is better than complex.
   : ?         ++++ ^                      ^
   : + 5. Flat is better than nested.

** textwrap. *indent* (text,prefix,predict=None)
   在TEXT中指定的行首添加PREFIX。
   
   每行使用TEXT.splitelines(True)分割获得。
   
   默认情况下，PREFIX添加到除只有whitespace的的行首：
   
   #+BEGIN_SRC python :session
     from textwrap import indent
     s = 'hello\n\n \nworld'
     indent(s, ' ')
   #+END_SRC
   
   #+RESULTS[b7affb53a05e91db1a56cd635f07660095b4b01d]:
   :
   : >>> ' hello\n\n \n world'
   
   可选参数PREDICT为函数对象，控制添加PREFIX的行。如对每行都都添加
   PREFIX：
   
   #+BEGIN_SRC python :session
     print(indent(s, '+', lambda line: True))
   #+END_SRC
   
   #+RESULTS[640c0451f755ecc09aa5ee372fcc9b6d9a79bbdd]:
   : +hello
   : +
   : +
   : +world
   
   wrap()、fill()和shorten()的原理为创建一个全新的TextWrapper实例，再
   调用对应方法。此实例不能被重用，所以对于频繁使用wrap()和fill()的应
   用，先创建TextWrapper对象效率更高。
   
   文本一般在空格或连字符后折叠。如果TextWrapper.break_long_words为
   False，则不折叠“长单词”。
   
